org/history/timeline-postmodernity.org
#+title: Timeline Postmodernity

* Timeline: Post Modernity 2025 CE - 3025 CE (a.k.a. by Setsafar Scholars as the late Pre-Bayesian Era)
** The Anthropocene Decline (2025 CE – 2150 CE)
*** Key Themes
**** Climate concerns prove ridled by Bernoulli's fallacy of frequentist models with fallacious inference.
There was an undeniable impact on the Eartyh's atmosphere due to carbon emmissions by humankind, but hubris was inserted to make the crisis seem far more extreme, and keep competing third world countries from competing with western markets by trying to enforce "Green Policies" on early developed economies.
