html/history/timeline-postmodernity.html
---
title: "Timeline Postmodernity"
---
<div id="outline-container-timeline-post-modernity-2025-ce-3025-ce-a-k-a-by-setsafar-scholars-as-the-late-pre-bayesian-era-" class="outline-2">
<h2 id="timeline-post-modernity-2025-ce-3025-ce-a-k-a-by-setsafar-scholars-as-the-late-pre-bayesian-era-">Timeline: Post Modernity 2025 CE - 3025 CE (a.k.a. by Setsafar Scholars as the late Pre-Bayesian Era)</h2>
<div class="outline-text-2" id="text-timeline-post-modernity-2025-ce-3025-ce-a-k-a-by-setsafar-scholars-as-the-late-pre-bayesian-era-">
</div>
<div id="outline-container-the-anthropocene-decline-2025-ce-2150-ce-" class="outline-3">
<h3 id="the-anthropocene-decline-2025-ce-2150-ce-">The Anthropocene Decline (2025 CE – 2150 CE)</h3>
<div class="outline-text-3" id="text-the-anthropocene-decline-2025-ce-2150-ce-">
</div>
<div id="outline-container-key-themes" class="outline-4">
<h4 id="key-themes">Key Themes</h4>
<div class="outline-text-4" id="text-key-themes">
</div>
<ul class="org-ul">
<li><a id="climate-concerns-prove-ridled-by-bernoulli-s-fallacy-of-frequentist-models-with-fallacious-inference-"></a>Climate concerns prove ridled by Bernoulli&rsquo;s fallacy of frequentist models with fallacious inference.<br />
<div class="outline-text-5" id="text-climate-concerns-prove-ridled-by-bernoulli-s-fallacy-of-frequentist-models-with-fallacious-inference-">
<p>
There was an undeniable impact on the Eartyh&rsquo;s atmosphere due to carbon emmissions by humankind, but hubris was inserted to make the crisis seem far more extreme, and keep competing third world countries from competing with western markets by trying to enforce &ldquo;Green Policies&rdquo; on early developed economies.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
